app/views/users/index.html.erb

SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
---
    				<%= link_to user_path(user) do %>
    				<h4 class="glyphicon glyphicon-book text-muted">.Post<%= user.books.count %></h4>