app/views/users/show.html.erb

SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
---

					<% @user.books.each do |book| %>

SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 18]]
---
					<td><%= link_to book_path(book) do %>
	    				<li class="list-inline"><i class="far fa-comment text-muted"><%= book.book_comments.count %></i>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 18]]
---
	    			<%= link_to book_path(book) do %>
            	<li class="list-inline"><i class="far fa-heart text-muted"><%= book.favorites.count %></i>