app/views/books/index.html.erb

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 8]]
---

	    	<td><%= link_to book_path(book), class: "blink" do %><i class="far fa-comment text-muted"><%= book.book_comments.count %></i>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 8]]
---

	    			<%= link_to book_path(book), class: "blink" do %><i class="far fa-heart text-muted"><%= book.favorites.count %></i>