app/views/books/show.html.erb

						<ul class="list-inline">
							<li><i class="fa fa-comment text-muted" aria-hidden="true"><%= @book.book_comments.count %></i>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]


                  <li><%= link_to book_favorite_path(@book, current_user.favorites.find_by(book_id: @book.id)), method: :delete do %>
                      <i class="fa fa-heart text-danger" aria-hidden="true" style="color: #FF66FF;">
                      <%= @book.favorites.count %></i>
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 3], ["book_id", 10], ["LIMIT", 1]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 8]]

                      <i class="fa fa-heart text-muted" aria-hidden="true">
                      <%= @book.favorites.count %></i>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 9]]


<% if @book.book_comments.count != 0 %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 9]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 9]]


				<% @book.book_comments.each do |book_comment| %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 9]]


<% if @book.favorites.count != 0 %>
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 9]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 9]]


				<% @book.favorites.each do |favorite| %>
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 9]]