app/controllers/books_controller.rb

  def create
  	@book_new = Book.new(book_params)
    @book_new.user_id = current_user.id
	  if @book_new.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "星の王子様"], ["body", "王子かわいかった"], ["user_id", 1], ["created_at", "2019-11-24 09:12:35.491598"], ["updated_at", "2019-11-24 09:12:35.491598"]]

	def destroy
  	@book = Book.find(params[:id])
    if @book.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]

  def correct_user
    book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]