app/controllers/book_comments_controller.rb

	def create
	  @book = Book.find(params[:book_id])
	  @book_commentnew = current_user.book_comments.new(book_comment_params)
	  @book_commentnew.book_id = @book.id
	  if @book_commentnew.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "わかるぅぅぅぅ"], ["user_id", 1], ["book_id", 18], ["created_at", "2019-11-26 01:48:11.747959"], ["updated_at", "2019-11-26 01:48:11.747959"]]

	def edit
		@book = Book.find(params[:book_id])
		@comment = BookComment.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]

	def update
	@book = Book.find(params[:book_id])
	@comment = BookComment.find(params[:id])
  if @comment.update(book_comment_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
UPDATE "book_comments" SET "comment" = ?, "updated_at" = ? WHERE "book_comments"."id" = ?  [["comment", "わかるぅぅぅぅ"], ["updated_at", "2019-11-25 12:20:29.540813"], ["id", 26]]

	def destroy
		book = Book.find(params[:book_id])
  	comment = BookComment.find(params[:id])
   	comment.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 28]]

	def correct_user
    comment = BookComment.find(params[:id])
---
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]