app/controllers/favorites_controller.rb

	def create
		book = Book.find(params[:book_id])
    favorite = current_user.favorites.new(book_id: book.id)
    favorite.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "created_at", "updated_at", "book_id") VALUES (?, ?, ?, ?)  [["user_id", 3], ["created_at", "2019-11-26 07:00:49.608350"], ["updated_at", "2019-11-26 07:00:49.608350"], ["book_id", 16]]