app/controllers/users_controller.rb

  def show
    @book_new = Book.new
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def index
    @book_new = Book.new
    @users = User.all
---
SELECT "users".* FROM "users"

  def following
    @user  = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]